updated readme+browser sign in in phone issue+welcome
